Autodesk.Revit.DB.CurveUV.Transform(Autodesk.Revit.DB.Transform2D)
Transform this CurveUV by the given 2D affine transform if possible.
trfUV:
The given 2D affine transform.
Returns:
If successful a transformed CurveUV, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.CurveUV.Create(Autodesk.Revit.DB.Curve)
Create a CurveUV from a bounded 3D Curve lying in the XY plane.
Remarks:
The XY plane is identified with the uv parameter space of the surface to which this SurfParamSpaceCurve refers.
curve3D:
The input bounded 3D Curve lying in the XY plane (i.e., z = 0 everywhere along the curve).
Returns:
The newly created CurveUV.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Curve is not a bounded 3D Curve lying in the XY plane (i.e., z = 0 everywhere along the curve).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021